# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open source relational database management system
brew "mysql-client@5.7"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Terminal-based AI coding assistant
cask "claude-code"
# All-in-one toolbox for developers
cask "devutils"
# Collaborative team software
cask "figma"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Create mock APIs in seconds
cask "mockoon"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
vscode "albert.tabout"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "cstrap.flask-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "heybourn.headwind"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mikoz.black-py"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "will-stone.plastic"
vscode "xabikos.javascriptsnippets"
